#Напишите программу, в которой пользователь будет задавать две строки, а программа - определять количество вхождений одной строки в другую
"""
numbers = []
    for el in range(n):
        #print(f'{el} -> {(-3)**el}')
        numbers.append((-3)**el)
    print(numbers)
"""